Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/home_owners/ground_rent.html.txt.tmx
Source language: en
Languages: ga

source: The 2 types of property ownership in Ireland are leasehold and freehold
ga: Tá dhá cineálacha éagsúla úinéireachta ar réadmhaoine in Éirinn – réadmhaoin ar léas agus réadmhaoin rúilse

source: Owning the leasehold interest in a property means that you own just the building and not the land it is on and that your ownership is for a fixed number of years
ga: Más le duine réadmhaoin ar léas is ionann sin agus gur leis/léi an foirgneamh amháin agus nach leis/léi an talamh ar a bhfuil sé tógtha agus go bhfuil úinéireacht aige/aici ar feadh méid áirithe blianta socraithe

source: If you own a leasehold property, you must pay a ground rent to your ground landlord - the person who owns the ground it is built on. The amount of ground rent paid varies
ga: Más leat réadmhaoin ar léas ní mór duit cíos talún a íoc leis an tiarna talún gur leis/léi an talamh ar a bhfuil an foirgneamh tógtha

source: Often the ground landlord is the local authority
ga: Ní mar a chéile a bhíonn méid an chíosa ar fud na tíre

source: Owning the freehold interest in a property means that you own the land and buildings (if any) outright
ga: Más leat réadmhaoin rúilse ciallaíonn sin gur leat an talamh agus na foirgnimh (más ann dóibh) ar fad

source: There is no period of years attached to the ownership and there is no ground rent to pay
ga: Níl aon tréimhse úinéireachta ag baint leis seo. Ní bhaineann cíos talún le réadmhaoin rúilse

source: When you are buying or selling a property, any ground rent will be recorded on the previous deeds (if the property is registered with the Registry of Deeds) or on the folio (if the property is registered with the Land Registry)
ga: Nuair atá réadmhaoin dhá cheannach nó dhá dhíol agat déanfar aon bunchíos a thaifead ar na gníomhais (má tá an mhaoin cláraithe le Clárlann na nGníomhas) nó ar an bhfóilió (má tá an mhaoin cláraithe ar Clárlann na Talún)

source: The Property Registration Authority (PRA) controls and manages both the Land Registry and the Registry of Deeds. Read more in our document on property deeds
ga: Is é an tÚdarás Clárúcháin Maoine a dhéanann Clárlann na nGníomhas agus Clárlann na Talún a rialú agus a bhainisteoireacht

source: The PRA 's Ground Rents Purchase Scheme allows leasehold owners to buy out their ground rent and become outright owners of their property
ga: Tá scéim ag Clárlann na Talún a thugann deis d'úinéirí réadmhaoine ar léas an bunchíos a cheannach amach agus a bheith ina n-úinéirí iomlána ar a maoine

source: In some circumstances it is not possible to buy out ground rents, if, for instance, it is not in the public interest, or if there is a specific clause in a lease preventing it, but these instances are rare
ga: Tá roinnt cásanna eisceachtúla ann nuair nach féidir bunchíosanna a cheannach amach, mar shampla muna bhfuil sé ar leas an phobail, nó má tá alt faoi leith i léas a chuireann cosc ar seo, ach ní minic a bhíonn na cásanna seo amhlaidh

source: Buying out your ground rent
ga: Do bhunchíos a cheannach amach

source: A person who is buying a property may be able to buy out the ground rent once the purchase of the property has been concluded
ga: Nuair atá duine ag ceannach maoine is minic go gceannaíonn sé/sí an bunchíos ag an am céanna

source: You can buy it either privately or through the Ground Rents Purchase Scheme
ga: Is féidir bunchíos a cheannach go príobháideach agus tríd Scéim Cheannaigh na mBunchíosanna

source: The amount to be paid when buying out the ground rent can either be agreed between you and the ground landlord (consent procedure) or else obtained through an arbitration procedure
ga: Is féidir leat féin agus an tiarna talún teacht ar réiteach maidir leis an méid atá le n-íoc leis an mbunchíos a cheannach amach nó d'fhéadfaí iarraidh ar eadránaí neamhspléach in oifig Chlárlann na Talún praghas a shocrú

source: The amount of ground rent is set by the arbitration procedure if you are buying it out under the Ground Rents Purchase Scheme and cannot agree the amount with the ground landlord. The PRA will do all the legal work for a fee
ga: Beidh Clárlann na Talún sásta breathnú i ndiaidh na hoibre dlíthiúil ar chostas, ag brath an bhfuil socrú déanta agaibh féin ar phraghas nó an bhfuil sibh ag iarraidh ar eadránaí Chlárlann na Talún an praghas a shocrú

source: It is more expensive if an arbitrator is involved - see 'Rates' below
ga: Tá an costas níos mó má bhíonn eadránaí i gceist

source: If you buy out your ground rent, whether from a private landlord or a local authority, the PRA will issue a Vesting Certificate
ga: Má cheannaíonn tú bunchíos ó thiarna talún príobháideach eiseófar Teastas Dílseacháin

source: The Vesting Certificate is a new title deed to your property
ga: Tá an éifeacht dlíthiúil chéanna aige seo agus atá ag cáipéis tíolactha agus déanann sé úinéireacht iomlán an áitribh a "dhílsiú" i d'ainm

source: As such, it is a very important document
ga: (Cineál gníomhais í cáipéis tíolactha.) Is gníomhas teidil do mhaoin nua é an Teastas Dílseacháin

source: You are strongly advised to have it registered with the Land Registry or the Registry of Deeds, as appropriate, to record the fact that your ownership of the property has changed from leasehold to freehold
ga: Is doiciméad an-tábhachtach é agus molfar duit go tréam do Teastas Dílseacháin a chlárú

source: If you are buying it out through the arbitration procedure, the fee is €105 for residential owners and €195 for non-residential owners
ga: I gClárlann na nGníomhas coinneofar cóip den cháipéis ar nós gur meabhrúchán a bhí ann. Achoimre ar an gcáipéis é meabhrúchán
